app/views/shops/show.html.erb

SELECT `shop_hours`.* FROM `shop_hours` WHERE `shop_hours`.`shop_id` = 1
---
                        <b>送餐时间：</b>
                        <%= @shop.shop_hours.collect{|s| s.start_time + '至' + s.end_time}.join(',') %>

SELECT `foods`.* FROM `foods` WHERE (food_type_id = 1 and enable = 1)
---
	                    		</div>
								<% ft.enable_foods.each do |food| %>