app/controllers/areas_controller.rb

  def show
    @area = Area.find(params[:id])
---
SELECT `areas`.* FROM `areas` WHERE `areas`.`id` = 1 LIMIT 1

  def check_shop
    @shop = Shop.find(params[:supID])
    @area = Area.find(params[:areaID])
    if @shop and @area and @area.shops.include?(@shop)
---
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
SELECT `areas`.* FROM `areas` WHERE `areas`.`id` = 1 LIMIT 1
SELECT 1 AS one FROM `shops` INNER JOIN `areas_shops` ON `shops`.`id` = `areas_shops`.`shop_id` WHERE `areas_shops`.`area_id` = 1 AND `shops`.`id` = 1 LIMIT 1
SELECT `shops`.id FROM `shops` INNER JOIN `areas_shops` ON `shops`.id = `areas_shops`.shop_id WHERE (`shops`.`id` = 1) AND (`areas_shops`.area_id = 1 ) LIMIT 1