app/controllers/home_controller.rb

SELECT `cities`.* FROM `cities`
---
  def index
    @cities = City.all