app/controllers/orders_controller.rb

SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 1 LIMIT 1
---
  def checkout
    info = JSON.parse(cookies[:KcbCarInfo])
    @shop = Shop.find(info["SupID"])

INSERT INTO `orders` (`address`, `order_num`, `created_at`, `current_price`, `updated_at`, `notes`, `area_id`, `shop_id`, `altphone`, `user_id`, `phone`, `original_price`, `state`) VALUES('华东大蛇丸', '2013-10-18 3', '2013-10-18 23:18:22', 10.0, '2013-10-18 23:18:22', '', 1, 1, '', 972344281, '12313131231', 15.0, 'creating')
---
  def SendOrder
    begin
      ActiveRecord::Base.transaction do
        #区域areaID、用户userID、地址address、电话phone、备选电话altPhone、备注notes、订餐信息kcbcartInfo
        area_id = params[:areaID]
        user_id = params[:userID]
        address = params[:address]
        phone = params[:phone]
        altPhone = params[:altPhone]
        notes = params[:notes]
        cartInfo = JSON.parse(params[:kcbcartInfo])
        #检查订单是否合法，小于0表示不合法，否则返回nil
        @legal_data = Order.check_legal(area_id,user_id,address,phone,altPhone,cartInfo)
        #legal_data为nil，表示订单合法，创建订单
        if @legal_data == nil
          #创建订单
          @legal_data = Order.create_order(area_id,user_id,address,phone,notes,altPhone,cartInfo)