app/controllers/personals_controller.rb

  def iAdd
    @area = Area.find(cookies[:areaID])
---
SELECT * FROM `areas` WHERE (`areas`.`id` = 1)