app/controllers/shops_controller.rb

  def show
    @shop = Shop.find(params[:id])
---
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 0 LIMIT 1

  def get_detail
    @shop = Shop.find(params[:shopID])
    detail = {}
    detail['SupplierID'] = @shop.id
    if @shop.check_hour
      detail['BusinessState'] = 1
    else
      detail['BusinessState'] = 0
    end
    detail['OrderCommentNum'] = @shop.order_commond_num
    detail['SupplierName'] = @shop.name
    detail['PrimaryBusiness'] = @shop.primary_businesses.collect{|p| p.name}.join(',')
---
SELECT `shops`.* FROM `shops` WHERE `shops`.`id` = 2 LIMIT 1
SELECT `shop_hours`.* FROM `shop_hours` WHERE `shop_hours`.`shop_id` = 2
SELECT `primary_businesses`.* FROM `primary_businesses` INNER JOIN `primary_businesses_shops` ON `primary_businesses`.`id` = `primary_businesses_shops`.`primary_business_id` WHERE `primary_businesses_shops`.`shop_id` = 2