app/controllers/user_contacts_controller.rb

  def CheckContactInfo
    #    user_contact = UserContact.find(:last,:conditions => ["addr = :addr and phone = :phone",{:addr => params[:addr], :phone => params[:phone]}])
    #    if user_contact
    #      value = nil
    #    else
    #      #9位以9开头的随机数
    #      random_number = 900000000 + rand(99999999)
    #      new_uc = UserContact.create(:user_id => random_number, :addr => params[:addr], :phone => params[:phone], :is_default => true)
    #      value = random_number
    #    end
    #修改为生成用户随机ID并记录联系方式
    random_number = 900000000 + rand(99999999)
    new_uc = UserContact.create(:user_id => random_number, :addr => params[:addr], :phone => params[:phone], :is_default => true)
---
INSERT INTO `user_contacts` (`created_at`, `is_default`, `updated_at`, `altphone`, `user_id`, `phone`, `addr`) VALUES('2013-10-05 08:28:00', 1, '2013-10-05 08:28:00', NULL, 943019896, '12312312312', '华东大厦')